Задание
Узнать, при продаже всех книг, какая книга принесет больше всего выручки, в процентах.
Структура и наполнение таблицы book:
+---------+-----------------------+------------------+--------+--------+
| book_id | title                 | author           | price  | amount |
+---------+-----------------------+------------------+--------+--------+
| 1       | Мастер и Маргарита    | Булгаков М.А.    | 670.99 | 3      |
| 2       | Белая гвардия         | Булгаков М.А.    | 540.50 | 5      |
| 3       | Идиот                 | Достоевский Ф.М. | 460.00 | 10     |
| 4       | Братья Карамазовы     | Достоевский Ф.М. | 799.01 | 3      |
| 5       | Игрок                 | Достоевский Ф.М. | 480.50 | 10     |
| 6       | Стихотворения и поэмы | Есенин С.А.      | 650.00 | 15     |
+---------+-----------------------+------------------+--------+--------+

SQL request

SELECT author, title, price, amount, price*amount AS cost,
ROUND((price*amount/(SELECT SUM(price*amount) FROM book))*100,2) AS total
FROM book
ORDER BY total DESC;

Query result:
+------------------+-----------------------+--------+--------+---------+-------+
| author           | title                 | price  | amount | cost    | total |
+------------------+-----------------------+--------+--------+---------+-------+
| Есенин С.А.      | Стихотворения и поэмы | 650.00 | 15     | 9750.00 | 37.12 |
| Достоевский Ф.М. | Игрок                 | 480.50 | 10     | 4805.00 | 18.29 |
| Достоевский Ф.М. | Идиот                 | 460.00 | 10     | 4600.00 | 17.51 |
| Булгаков М.А.    | Белая гвардия         | 540.50 | 5      | 2702.50 | 10.29 |
| Достоевский Ф.М. | Братья Карамазовы     | 799.01 | 3      | 2397.03 | 9.13  |
| Булгаков М.А.    | Мастер и Маргарита    | 670.99 | 3      | 2012.97 | 7.66  |
+------------------+-----------------------+--------+--------+---------+-------+
Affected rows: 6